server/soap/economicIndexEnvelope.xml

<?xml version="1.0" encoding="utf-8"?>
<soap:Envelope xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/">
  <soap:Body>
    <ObtenerIndicadoresEconomicos xmlns="http://ws.sdde.bccr.fi.cr">
      <tcIndicador>317</tcIndicador>
      <tcFechaInicio>01/01/2018</tcFechaInicio>
      <tcFechaFinal>01/02/2018</tcFechaFinal>
      <tcNombre>Kevin</tcNombre>
      <tnSubNiveles>N</tnSubNiveles>
    </ObtenerIndicadoresEconomicos>
  </soap:Body>
</soap:Envelope>