src/wsdl/gee.bccr.fi.cr/Indicadores/Suscripciones/WS/wsindicadoreseconomicos.asmx.op_obtenerindicadoreseconomicos



<html>

    <head><link rel="alternate" type="text/xml" href="/Indicadores/Suscripciones/WS/wsindicadoreseconomicos.asmx?disco" />

    <style type="text/css">
    
		BODY { color: #000000; background-color: white; font-family: Verdana; margin-left: 0px; margin-top: 0px; }
		#content { margin-left: 30px; font-size: .70em; padding-bottom: 2em; }
		A:link { color: #336699; font-weight: bold; text-decoration: underline; }
		A:visited { color: #6699cc; font-weight: bold; text-decoration: underline; }
		A:active { color: #336699; font-weight: bold; text-decoration: underline; }
		A:hover { color: cc3300; font-weight: bold; text-decoration: underline; }
		P { color: #000000; margin-top: 0px; margin-bottom: 12px; font-family: Verdana; }
		pre { background-color: #e5e5cc; padding: 5px; font-family: Courier New; font-size: x-small; margin-top: -5px; border: 1px #f0f0e0 solid; }
		td { color: #000000; font-family: Verdana; font-size: .7em; }
		h2 { font-size: 1.5em; font-weight: bold; margin-top: 25px; margin-bottom: 10px; border-top: 1px solid #003366; margin-left: -15px; color: #003366; }
		h3 { font-size: 1.1em; color: #000000; margin-left: -15px; margin-top: 10px; margin-bottom: 10px; }
		ul { margin-top: 10px; margin-left: 20px; }
		ol { margin-top: 10px; margin-left: 20px; }
		li { margin-top: 10px; color: #000000; }
		font.value { color: darkblue; font: bold; }
		font.key { color: darkgreen; font: bold; }
		font.error { color: darkred; font: bold; }
		.heading1 { color: #ffffff; font-family: Tahoma; font-size: 26px; font-weight: normal; background-color: #003366; margin-top: 0px; margin-bottom: 0px; margin-left: -30px; padding-top: 10px; padding-bottom: 3px; padding-left: 15px; width: 105%; }
		.button { background-color: #dcdcdc; font-family: Verdana; font-size: 1em; border-top: #cccccc 1px solid; border-bottom: #666666 1px solid; border-left: #cccccc 1px solid; border-right: #666666 1px solid; }
		.frmheader { color: #000000; background: #dcdcdc; font-family: Verdana; font-size: .7em; font-weight: normal; border-bottom: 1px solid #dcdcdc; padding-top: 2px; padding-bottom: 2px; }
		.frmtext { font-family: Verdana; font-size: .7em; margin-top: 8px; margin-bottom: 0px; margin-left: 32px; }
		.frmInput { font-family: Verdana; font-size: 1em; }
		.intro { margin-left: -15px; }
           
    </style>

    <title>
	wsindicadoreseconomicos Web Service
</title></head>

  <body>

    <div id="content">

      <p class="heading1">wsindicadoreseconomicos</p><br>

      

      

      <span>
          <p class="intro">Click <a href="wsindicadoreseconomicos.asmx">here</a> for a complete list of operations.</p>
          <h2>ObtenerIndicadoresEconomicos</h2>
          <p class="intro">Obtiene los valores del indicador económico deseado (DataSet) para un rango de fecha determinado con formato dd/mm/yyyy (día/mes/año). Parámetros de entrada: Indicador de tipo numérico entero positivo, Fecha de inicio de tipo string , Fecha final de tipo string, Nombre de la persona que utiliza el servicio, SubNiveles (S = Si o N = No) para indicar si desea o no obtener los subniveles del indicador a consultar, correo electrónico y token de suscripción. Retorna un DataSet con los siguientes campos: Código de la variable tipo string, fecha tipo date y el valor tipo numeric. TODOS los campos son obligatorios, de no ingresar alguno de los parámetros el valor de retorno del servicio será Nothing. </p>

          <h3>Test</h3>
          
          To test the operation using the HTTP POST protocol, click the 'Invoke' button.



                      <form target="_blank" action='https://gee.bccr.fi.cr/Indicadores/Suscripciones/WS/wsindicadoreseconomicos.asmx/ObtenerIndicadoresEconomicos' method="POST">                      
                        
                          <table cellspacing="0" cellpadding="4" frame="box" bordercolor="#dcdcdc" rules="none" style="border-collapse: collapse;">
                          <tr>
	<td class="frmHeader" background="#dcdcdc" style="border-right: 2px solid white;">Parameter</td>
	<td class="frmHeader" background="#dcdcdc">Value</td>
</tr>

                        
                          <tr>
                            <td class="frmText" style="color: #000000; font-weight: normal;">Indicador:</td>
                            <td><input class="frmInput" type="text" size="50" name="Indicador"></td>
                          </tr>
                        
                          <tr>
                            <td class="frmText" style="color: #000000; font-weight: normal;">FechaInicio:</td>
                            <td><input class="frmInput" type="text" size="50" name="FechaInicio"></td>
                          </tr>
                        
                          <tr>
                            <td class="frmText" style="color: #000000; font-weight: normal;">FechaFinal:</td>
                            <td><input class="frmInput" type="text" size="50" name="FechaFinal"></td>
                          </tr>
                        
                          <tr>
                            <td class="frmText" style="color: #000000; font-weight: normal;">Nombre:</td>
                            <td><input class="frmInput" type="text" size="50" name="Nombre"></td>
                          </tr>
                        
                          <tr>
                            <td class="frmText" style="color: #000000; font-weight: normal;">SubNiveles:</td>
                            <td><input class="frmInput" type="text" size="50" name="SubNiveles"></td>
                          </tr>
                        
                          <tr>
                            <td class="frmText" style="color: #000000; font-weight: normal;">CorreoElectronico:</td>
                            <td><input class="frmInput" type="text" size="50" name="CorreoElectronico"></td>
                          </tr>
                        
                          <tr>
                            <td class="frmText" style="color: #000000; font-weight: normal;">Token:</td>
                            <td><input class="frmInput" type="text" size="50" name="Token"></td>
                          </tr>
                        
                        <tr>
                          <td></td>
                          <td align="right"> <input type="submit" value="Invoke" class="button"></td>
                        </tr>
                        </table>
                      

                    </form>
                  <span>
              <h3>SOAP 1.1</h3>
              <p>The following is a sample SOAP 1.1 request and response.  The <font class=value>placeholders</font> shown need to be replaced with actual values.</p>

              <pre>POST /Indicadores/Suscripciones/WS/wsindicadoreseconomicos.asmx HTTP/1.1
Host: gee.bccr.fi.cr
Content-Type: text/xml; charset=utf-8
Content-Length: <font class=value>length</font>
SOAPAction: "http://ws.sdde.bccr.fi.cr/ObtenerIndicadoresEconomicos"

&lt;?xml version="1.0" encoding="utf-8"?&gt;
&lt;soap:Envelope xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/"&gt;
  &lt;soap:Body&gt;
    &lt;ObtenerIndicadoresEconomicos xmlns="http://ws.sdde.bccr.fi.cr"&gt;
      &lt;Indicador&gt;<font class=value>string</font>&lt;/Indicador&gt;
      &lt;FechaInicio&gt;<font class=value>string</font>&lt;/FechaInicio&gt;
      &lt;FechaFinal&gt;<font class=value>string</font>&lt;/FechaFinal&gt;
      &lt;Nombre&gt;<font class=value>string</font>&lt;/Nombre&gt;
      &lt;SubNiveles&gt;<font class=value>string</font>&lt;/SubNiveles&gt;
      &lt;CorreoElectronico&gt;<font class=value>string</font>&lt;/CorreoElectronico&gt;
      &lt;Token&gt;<font class=value>string</font>&lt;/Token&gt;
    &lt;/ObtenerIndicadoresEconomicos&gt;
  &lt;/soap:Body&gt;
&lt;/soap:Envelope&gt;</pre>

              <pre>HTTP/1.1 200 OK
Content-Type: text/xml; charset=utf-8
Content-Length: <font class=value>length</font>

&lt;?xml version="1.0" encoding="utf-8"?&gt;
&lt;soap:Envelope xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/"&gt;
  &lt;soap:Body&gt;
    &lt;ObtenerIndicadoresEconomicosResponse xmlns="http://ws.sdde.bccr.fi.cr"&gt;
      &lt;ObtenerIndicadoresEconomicosResult&gt;
        &lt;xsd:schema&gt;<font class=value>schema</font>&lt;/xsd:schema&gt;<font class=value>xml</font>&lt;/ObtenerIndicadoresEconomicosResult&gt;
    &lt;/ObtenerIndicadoresEconomicosResponse&gt;
  &lt;/soap:Body&gt;
&lt;/soap:Envelope&gt;</pre>
          </span>

          <span>
              <h3>SOAP 1.2</h3>
              <p>The following is a sample SOAP 1.2 request and response.  The <font class=value>placeholders</font> shown need to be replaced with actual values.</p>

              <pre>POST /Indicadores/Suscripciones/WS/wsindicadoreseconomicos.asmx HTTP/1.1
Host: gee.bccr.fi.cr
Content-Type: application/soap+xml; charset=utf-8
Content-Length: <font class=value>length</font>

&lt;?xml version="1.0" encoding="utf-8"?&gt;
&lt;soap12:Envelope xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:soap12="http://www.w3.org/2003/05/soap-envelope"&gt;
  &lt;soap12:Body&gt;
    &lt;ObtenerIndicadoresEconomicos xmlns="http://ws.sdde.bccr.fi.cr"&gt;
      &lt;Indicador&gt;<font class=value>string</font>&lt;/Indicador&gt;
      &lt;FechaInicio&gt;<font class=value>string</font>&lt;/FechaInicio&gt;
      &lt;FechaFinal&gt;<font class=value>string</font>&lt;/FechaFinal&gt;
      &lt;Nombre&gt;<font class=value>string</font>&lt;/Nombre&gt;
      &lt;SubNiveles&gt;<font class=value>string</font>&lt;/SubNiveles&gt;
      &lt;CorreoElectronico&gt;<font class=value>string</font>&lt;/CorreoElectronico&gt;
      &lt;Token&gt;<font class=value>string</font>&lt;/Token&gt;
    &lt;/ObtenerIndicadoresEconomicos&gt;
  &lt;/soap12:Body&gt;
&lt;/soap12:Envelope&gt;</pre>

              <pre>HTTP/1.1 200 OK
Content-Type: application/soap+xml; charset=utf-8
Content-Length: <font class=value>length</font>

&lt;?xml version="1.0" encoding="utf-8"?&gt;
&lt;soap12:Envelope xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:soap12="http://www.w3.org/2003/05/soap-envelope"&gt;
  &lt;soap12:Body&gt;
    &lt;ObtenerIndicadoresEconomicosResponse xmlns="http://ws.sdde.bccr.fi.cr"&gt;
      &lt;ObtenerIndicadoresEconomicosResult&gt;
        &lt;xsd:schema&gt;<font class=value>schema</font>&lt;/xsd:schema&gt;<font class=value>xml</font>&lt;/ObtenerIndicadoresEconomicosResult&gt;
    &lt;/ObtenerIndicadoresEconomicosResponse&gt;
  &lt;/soap12:Body&gt;
&lt;/soap12:Envelope&gt;</pre>
          </span>

          <span>
              <h3>HTTP GET</h3>
              <p>The following is a sample HTTP GET request and response.  The <font class=value>placeholders</font> shown need to be replaced with actual values.</p>

              <pre>GET /Indicadores/Suscripciones/WS/wsindicadoreseconomicos.asmx/ObtenerIndicadoresEconomicos?<font class=key>Indicador</font>=<font class=value>string</font>&amp;<font class=key>FechaInicio</font>=<font class=value>string</font>&amp;<font class=key>FechaFinal</font>=<font class=value>string</font>&amp;<font class=key>Nombre</font>=<font class=value>string</font>&amp;<font class=key>SubNiveles</font>=<font class=value>string</font>&amp;<font class=key>CorreoElectronico</font>=<font class=value>string</font>&amp;<font class=key>Token</font>=<font class=value>string</font> HTTP/1.1
Host: gee.bccr.fi.cr
</pre>

              <pre>HTTP/1.1 200 OK
Content-Type: text/xml; charset=utf-8
Content-Length: <font class=value>length</font>

&lt;?xml version="1.0" encoding="utf-8"?&gt;
&lt;DataSet xmlns="http://ws.sdde.bccr.fi.cr"&gt;
  &lt;schema xmlns="http://www.w3.org/2001/XMLSchema"&gt;<font class=value>schema</font>&lt;/schema&gt;<font class=value>xml</font>&lt;/DataSet&gt;</pre>
          </span>

          <span>
              <h3>HTTP POST</h3>
              <p>The following is a sample HTTP POST request and response.  The <font class=value>placeholders</font> shown need to be replaced with actual values.</p>

              <pre>POST /Indicadores/Suscripciones/WS/wsindicadoreseconomicos.asmx/ObtenerIndicadoresEconomicos HTTP/1.1
Host: gee.bccr.fi.cr
Content-Type: application/x-www-form-urlencoded
Content-Length: <font class=value>length</font>

<font class=key>Indicador</font>=<font class=value>string</font>&amp;<font class=key>FechaInicio</font>=<font class=value>string</font>&amp;<font class=key>FechaFinal</font>=<font class=value>string</font>&amp;<font class=key>Nombre</font>=<font class=value>string</font>&amp;<font class=key>SubNiveles</font>=<font class=value>string</font>&amp;<font class=key>CorreoElectronico</font>=<font class=value>string</font>&amp;<font class=key>Token</font>=<font class=value>string</font></pre>

              <pre>HTTP/1.1 200 OK
Content-Type: text/xml; charset=utf-8
Content-Length: <font class=value>length</font>

&lt;?xml version="1.0" encoding="utf-8"?&gt;
&lt;DataSet xmlns="http://ws.sdde.bccr.fi.cr"&gt;
  &lt;schema xmlns="http://www.w3.org/2001/XMLSchema"&gt;<font class=value>schema</font>&lt;/schema&gt;<font class=value>xml</font>&lt;/DataSet&gt;</pre>
          </span>

      </span>
      

    
    
      

      

    
  </body>
</html>
